
#Healthを用いた集計
#データの読み込み
healthc <-read.csv('https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2301/health3.csv')

##Tableohealthc <- ne　集計表の作成

library(tableone)
tbl_1 <- CreateTableOne(vars = c("sex","age", "sbp","dbp","salt","HTN_c"), strata="sex",factorVars=c("sex","HTN_c"),data = healthc)

tbl_1
##                   Stratified by sex
##                    F              M               p      test
##   n                   244            177                     
##   sex = M (%)           0 ( 0.0)     177 (100.0)  <0.001     
##   age (mean (SD))   58.45 (8.06)   59.53 (7.45)    0.166     
##   sbp (mean (SD))  122.73 (16.27) 125.49 (15.80)   0.083     
##   dbp (mean (SD))   72.23 (9.50)   76.62 (10.70)  <0.001     
##   salt (mean (SD))   9.33 (2.10)    9.41 (1.93)    0.664     
##   HTN_c (%)                                        0.013     
##      1                110 (45.1)      51 ( 28.8)             
##      2                 35 (14.3)      39 ( 22.0)             
##      3                 83 (34.0)      68 ( 38.4)             
##      4                 15 ( 6.1)      16 (  9.0)             
##      5                  1 ( 0.4)       2 (  1.1)             
##      6                  0 ( 0.0)       1 (  0.6)
##tidyverse グラフ作成のため導入

library(tidyverse)
## -- Attaching packages --------------------------------------- tidyverse 1.3.2 --
## v ggplot2 3.3.6     v purrr   0.3.4
## v tibble  3.1.8     v dplyr   1.0.9
## v tidyr   1.2.1     v stringr 1.4.1
## v readr   2.1.2     v forcats 0.5.2
## -- Conflicts ------------------------------------------ tidyverse_conflicts() --
## x dplyr::filter() masks stats::filter()
## x dplyr::lag()    masks stats::lag()
install.packages("tidyverse")
## Warning: パッケージ 'tidyverse' は使用中のため、インストールされません
##plot　種々のグラフ
g_point_2 <- ggplot(data= healthc, aes(x = sbp, y = dbp))+geom_point () +theme_classic()
g_point_2


##boxplot　箱ひげ図
g_box<- ggplot(data= healthc, aes(x = factor(sex), y = sbp))+geom_boxplot()
g_box


##histgram　ヒストグラム
g_hist<- ggplot(data= healthc, aes(x = age)) +geom_histogram(fill="white", color="black")+theme_classic()
g_hist
## `stat_bin()` using `bins = 30`. Pick better value with `binwidth`.


##violinplot　
g_vp<-ggplot(data= healthc, mapping = aes(x = factor(sex), y = sbp)) +
  geom_violin() +
  geom_point() +
  labs(title = "sex") +
  theme_bw() + theme(legend.key = element_blank())

g_vp


##相関 Correlation

attach(healthc)
cor(cbind(sbp, dbp))
##           sbp       dbp
## sbp 1.0000000 0.7189422
## dbp 0.7189422 1.0000000
cor.test(sbp, dbp)
## 
##  Pearson's product-moment correlation
## 
## data:  sbp and dbp
## t = 21.173, df = 419, p-value < 2.2e-16
## alternative hypothesis: true correlation is not equal to 0
## 95 percent confidence interval:
##  0.6693624 0.7621467
## sample estimates:
##       cor 
## 0.7189422
cor(sbp , dbp, method="spearman")
## [1] 0.7193167
cor(sbp , dbp, method="pearson")
## [1] 0.7189422
quant<-cbind (healthc$age, healthc$sbp, healthc$dbp, healthc$salt)
quant2<-cbind (age, sbp, dbp, salt)
cor(quant2)
##             age       sbp        dbp       salt
## age  1.00000000 0.1686048 0.01739726 0.08910298
## sbp  0.16860481 1.0000000 0.71894223 0.17764427
## dbp  0.01739726 0.7189422 1.00000000 0.15370642
## salt 0.08910298 0.1776443 0.15370642 1.00000000
pairs(quant2)


#２日目

##t検定演習

##Darwin’s corn data

corn <- read.csv("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2302/darwin.csv")

# psychを使用
library(psych)
## 
##  次のパッケージを付け加えます: 'psych'
##  以下のオブジェクトは 'package:ggplot2' からマスクされています: 
## 
##      %+%, alpha
describe(corn)

##       vars  n  mean   sd median trimmed  mad min  max range  skew kurtosis   se
## group    1 30  1.50 0.51   1.50    1.50 0.74   1  2.0   1.0  0.00    -2.07 0.09
## len      2 30 18.88 3.18  18.88   19.17 3.34  12 23.5  11.5 -0.61    -0.44 0.58
##boxplot　箱ひげ図

g_box_c<- ggplot(data= corn, aes(x = factor(group), y = len))+geom_boxplot()
g_box_c


##t-test, Wilcoxon
t.test(len ~ group, data=corn)
## 
##  Welch Two Sample t-test
## 
## data:  len by group
## t = 2.4371, df = 22.164, p-value = 0.02328
## alternative hypothesis: true difference in means between group 1 and group 2 is not equal to 0
## 95 percent confidence interval:
##  0.3909566 4.8423767
## sample estimates:
## mean in group 1 mean in group 2 
##        20.19167        17.57500
wilcox.test(len ~ group, data=corn)
## Warning in wilcox.test.default(x = c(23.5, 12, 21, 22, 19.125, 21.5, 22.125, :
## cannot compute exact p-value with ties
## 
##  Wilcoxon rank sum test with continuity correction
## 
## data:  len by group
## W = 185.5, p-value = 0.002608
## alternative hypothesis: true location shift is not equal to 0




#３日目

##χ2乗検定/Fisher’s exact

##クロス表型による指定

#リューマチ薬の試験
#セルの数字を読み込む
testresults2 <- matrix( c(28,13, 14,29), nrow=2, byrow=T) 
chisq.test(testresults2)   

## 
##  Pearson's Chi-squared test with Yates' continuity correction
## 
## data:  testresults2
## X-squared = 9.3386, df = 1, p-value = 0.002244
fisher.test(testresults2) 
## 
##  Fisher's Exact Test for Count Data
## 
## data:  testresults2
## p-value = 0.002056
## alternative hypothesis: true odds ratio is not equal to 1
## 95 percent confidence interval:
##   1.631439 12.374422
## sample estimates:
## odds ratio 
##   4.375354
#マクネマー検定(対応のあるデータ）)
#腰痛の有無
mcnemar.test(matrix(c(47, 16, 5, 32), 2, 2))
## 
##  McNemar's Chi-squared test with continuity correction
## 
## data:  matrix(c(47, 16, 5, 32), 2, 2)
## McNemar's chi-squared = 4.7619, df = 1, p-value = 0.0291
#両親のどちらに相談するかどうか
mcnemar.test(matrix(c(32, 48, 8, 12), 2, 2))
## 
##  McNemar's Chi-squared test with continuity correction
## 
## data:  matrix(c(32, 48, 8, 12), 2, 2)
## McNemar's chi-squared = 27.161, df = 1, p-value = 1.872e-07
#第３日目

##重回帰分析　Linear regression

###An example is shown in Ans1. This is applied to Ans2 through Ans4 as a reference.

library(tidyverse)
library(haven)

Ans1 <- read.csv("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2303/Ans1.csv")
model_linear <- glm(y ~ x, family = gaussian(link ="identity"), data=Ans1)
lmY = lm(y ~ x, data = Ans1) 
summary(lmY) 
## 
## Call:
## lm(formula = y ~ x, data = Ans1)
## 
## Residuals:
##      Min       1Q   Median       3Q      Max 
## -1.92127 -0.45577 -0.04136  0.70941  1.83882 
## 
## Coefficients:
##             Estimate Std. Error t value Pr(>|t|)   
## (Intercept)   3.0001     1.1247   2.667  0.02573 * 
## x             0.5001     0.1179   4.241  0.00217 **
## ---
## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1
## 
## Residual standard error: 1.237 on 9 degrees of freedom
## Multiple R-squared:  0.6665, Adjusted R-squared:  0.6295 
## F-statistic: 17.99 on 1 and 9 DF,  p-value: 0.00217


library(haven)
select <- read.csv("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2303/select.csv")

data(select)
## Warning in data(select): data set 'select' not found
# fit1に回帰モデルを格納する
fit1 <- lm(formula = y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x11 + x12 + x13 + x14 +x15, data = select) 

res1 <- step(fit1)
## Start:  AIC=31.46
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x11 + 
##     x12 + x13 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x12   1     0.007  99.472 29.471
## - x11   1     0.010  99.475 29.474
## - x9    1     0.020  99.485 29.484
## - x4    1     0.022  99.487 29.485
## - x13   1     0.058  99.523 29.522
## - x6    1     0.113  99.578 29.577
## - x14   1     0.337  99.802 29.802
## - x1    1     0.378  99.843 29.843
## - x10   1     0.398  99.863 29.863
## - x15   1     0.898 100.363 30.362
## - x7    1     0.935 100.400 30.399
## - x5    1     1.582 101.047 31.041
## - x8    1     1.721 101.186 31.179
## <none>               99.465 31.464
## - x2    1     3.051 102.516 32.485
## - x3    1    62.042 161.507 77.938
## 
## Step:  AIC=29.47
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x11 + 
##     x13 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x11   1     0.008  99.480 27.478
## - x9    1     0.020  99.492 27.490
## - x4    1     0.021  99.493 27.492
## - x13   1     0.073  99.545 27.544
## - x6    1     0.116  99.588 27.587
## - x14   1     0.341  99.813 27.813
## - x1    1     0.375  99.847 27.847
## - x10   1     0.407  99.879 27.879
## - x15   1     0.903 100.376 28.375
## - x7    1     0.928 100.401 28.400
## - x5    1     1.575 101.047 29.042
## - x8    1     1.753 101.225 29.217
## <none>               99.472 29.471
## - x2    1     3.044 102.516 30.485
## - x3    1    62.037 161.509 75.939
## 
## Step:  AIC=27.48
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x13 + 
##     x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x4    1     0.019  99.499 25.498
## - x9    1     0.028  99.508 25.506
## - x13   1     0.088  99.567 25.566
## - x6    1     0.118  99.598 25.597
## - x14   1     0.340  99.819 25.819
## - x1    1     0.369  99.848 25.848
## - x10   1     0.400  99.880 25.880
## - x15   1     0.934 100.414 26.413
## - x7    1     0.936 100.416 26.415
## - x5    1     1.624 101.104 27.098
## - x8    1     1.746 101.226 27.219
## <none>               99.480 27.478
## - x2    1     3.117 102.597 28.564
## - x3    1    63.346 162.826 74.751
## 
## Step:  AIC=25.5
## y ~ x1 + x2 + x3 + x5 + x6 + x7 + x8 + x9 + x10 + x13 + x14 + 
##     x15
## 
##        Df Sum of Sq     RSS    AIC
## - x9    1     0.030  99.528 23.527
## - x13   1     0.091  99.590 23.589
## - x6    1     0.106  99.605 23.604
## - x14   1     0.331  99.830 23.830
## - x10   1     0.387  99.885 23.885
## - x7    1     0.925 100.424 24.423
## - x15   1     0.927 100.426 24.425
## - x5    1     1.704 101.202 25.195
## - x8    1     1.772 101.271 25.263
## <none>               99.499 25.498
## - x2    1     3.235 102.734 26.697
## - x3    1    64.460 163.959 73.445
## - x1    1    89.252 188.751 87.526
## 
## Step:  AIC=23.53
## y ~ x1 + x2 + x3 + x5 + x6 + x7 + x8 + x10 + x13 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x13   1     0.098  99.626 21.625
## - x6    1     0.105  99.633 21.633
## - x14   1     0.334  99.862 21.862
## - x10   1     0.390  99.918 21.918
## - x7    1     0.898 100.426 22.425
## - x15   1     0.899 100.427 22.427
## - x5    1     1.739 101.268 23.260
## - x8    1     1.812 101.340 23.331
## <none>               99.528 23.527
## - x2    1     3.286 102.814 24.775
## - x3    1    65.886 165.414 72.328
## - x1    1    89.761 189.289 85.811
## 
## Step:  AIC=21.63
## y ~ x1 + x2 + x3 + x5 + x6 + x7 + x8 + x10 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x6    1     0.137  99.763 19.763
## - x14   1     0.268  99.894 19.894
## - x10   1     0.379 100.005 20.005
## - x15   1     0.901 100.527 20.526
## - x7    1     0.958 100.583 20.582
## - x8    1     1.767 101.393 21.383
## - x5    1     1.802 101.428 21.418
## <none>               99.626 21.625
## - x2    1     3.396 103.022 22.977
## - x3    1    66.674 166.300 70.862
## - x1    1    90.347 189.973 84.171
## 
## Step:  AIC=19.76
## y ~ x1 + x2 + x3 + x5 + x7 + x8 + x10 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x14   1     0.312 100.075 18.075
## - x10   1     0.506 100.268 18.268
## - x15   1     0.904 100.667 18.665
## - x7    1     1.048 100.811 18.808
## - x5    1     1.742 101.505 19.494
## <none>               99.763 19.763
## - x8    1     2.274 102.037 20.017
## - x2    1     3.321 103.084 21.037
## - x3    1    67.505 167.268 69.443
## - x1    1    90.938 190.701 82.554
## 
## Step:  AIC=18.07
## y ~ x1 + x2 + x3 + x5 + x7 + x8 + x10 + x15
## 
##        Df Sum of Sq    RSS    AIC
## - x10   1     0.441 100.52 16.515
## - x15   1     0.944 101.02 17.014
## - x7    1     0.956 101.03 17.026
## - x5    1     1.706 101.78 17.765
## <none>              100.08 18.075
## - x8    1     2.301 102.38 18.348
## - x2    1     3.278 103.35 19.298
## - x3    1    67.233 167.31 67.466
## - x1    1    90.885 190.96 80.689
## 
## Step:  AIC=16.51
## y ~ x1 + x2 + x3 + x5 + x7 + x8 + x15
## 
##        Df Sum of Sq    RSS    AIC
## - x7    1     0.871 101.39 15.377
## - x15   1     0.934 101.45 15.439
## - x5    1     1.745 102.26 16.236
## <none>              100.52 16.515
## - x8    1     2.262 102.78 16.741
## - x2    1     3.335 103.85 17.779
## - x3    1    69.030 169.55 66.795
## - x1    1    90.692 191.21 78.819
## 
## Step:  AIC=15.38
## y ~ x1 + x2 + x3 + x5 + x8 + x15
## 
##        Df Sum of Sq    RSS    AIC
## - x15   1     0.943 102.33 14.303
## - x5    1     1.694 103.08 15.035
## - x8    1     1.908 103.30 15.242
## <none>              101.39 15.377
## - x2    1     3.250 104.64 16.532
## - x3    1    71.140 172.53 66.538
## - x1    1    91.654 193.04 77.773
## 
## Step:  AIC=14.3
## y ~ x1 + x2 + x3 + x5 + x8
## 
##        Df Sum of Sq    RSS    AIC
## - x5    1     1.645 103.97 13.898
## - x8    1     1.845 104.17 14.089
## <none>              102.33 14.303
## - x2    1     3.186 105.52 15.369
## - x3    1    70.542 172.87 64.738
## - x1    1    90.899 193.23 75.870
## 
## Step:  AIC=13.9
## y ~ x1 + x2 + x3 + x8
## 
##        Df Sum of Sq    RSS    AIC
## <none>              103.97 13.898
## - x8    1     2.548 106.52 14.319
## - x3    1    70.912 174.89 63.896
## - x1    1    89.585 193.56 74.041
## - x2    1    93.028 197.00 75.805
summary(res1)
## 
## Call:
## lm(formula = y ~ x1 + x2 + x3 + x8, data = select)
## 
## Residuals:
##      Min       1Q   Median       3Q      Max 
## -2.25400 -0.67564  0.02679  0.64191  2.34090 
## 
## Coefficients:
##             Estimate Std. Error t value Pr(>|t|)    
## (Intercept)  0.01295    0.10738   0.121    0.904    
## x1           1.02018    0.11276   9.047 1.80e-14 ***
## x2           0.97991    0.10629   9.219 7.70e-15 ***
## x3           0.82774    0.10283   8.049 2.37e-12 ***
## x8          -0.18006    0.11801  -1.526    0.130    
## ---
## Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1
## 
## Residual standard error: 1.046 on 95 degrees of freedom
## Multiple R-squared:  0.7239, Adjusted R-squared:  0.7123 
## F-statistic: 62.27 on 4 and 95 DF,  p-value: < 2.2e-16
##MASSによる方法
library(MASS)
## 
##  次のパッケージを付け加えます: 'MASS'
##  以下のオブジェクトは 'package:dplyr' からマスクされています: 
## 
##      select
res2 <- stepAIC(fit1, direction="both")
## Start:  AIC=31.46
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x11 + 
##     x12 + x13 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x12   1     0.007  99.472 29.471
## - x11   1     0.010  99.475 29.474
## - x9    1     0.020  99.485 29.484
## - x4    1     0.022  99.487 29.485
## - x13   1     0.058  99.523 29.522
## - x6    1     0.113  99.578 29.577
## - x14   1     0.337  99.802 29.802
## - x1    1     0.378  99.843 29.843
## - x10   1     0.398  99.863 29.863
## - x15   1     0.898 100.363 30.362
## - x7    1     0.935 100.400 30.399
## - x5    1     1.582 101.047 31.041
## - x8    1     1.721 101.186 31.179
## <none>               99.465 31.464
## - x2    1     3.051 102.516 32.485
## - x3    1    62.042 161.507 77.938
## 
## Step:  AIC=29.47
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x11 + 
##     x13 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x11   1     0.008  99.480 27.478
## - x9    1     0.020  99.492 27.490
## - x4    1     0.021  99.493 27.492
## - x13   1     0.073  99.545 27.544
## - x6    1     0.116  99.588 27.587
## - x14   1     0.341  99.813 27.813
## - x1    1     0.375  99.847 27.847
## - x10   1     0.407  99.879 27.879
## - x15   1     0.903 100.376 28.375
## - x7    1     0.928 100.401 28.400
## - x5    1     1.575 101.047 29.042
## - x8    1     1.753 101.225 29.217
## <none>               99.472 29.471
## - x2    1     3.044 102.516 30.485
## + x12   1     0.007  99.465 31.464
## - x3    1    62.037 161.509 75.939
## 
## Step:  AIC=27.48
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x13 + 
##     x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x4    1     0.019  99.499 25.498
## - x9    1     0.028  99.508 25.506
## - x13   1     0.088  99.567 25.566
## - x6    1     0.118  99.598 25.597
## - x14   1     0.340  99.819 25.819
## - x1    1     0.369  99.848 25.848
## - x10   1     0.400  99.880 25.880
## - x15   1     0.934 100.414 26.413
## - x7    1     0.936 100.416 26.415
## - x5    1     1.624 101.104 27.098
## - x8    1     1.746 101.226 27.219
## <none>               99.480 27.478
## - x2    1     3.117 102.597 28.564
## + x11   1     0.008  99.472 29.471
## + x12   1     0.005  99.475 29.474
## - x3    1    63.346 162.826 74.751
## 
## Step:  AIC=25.5
## y ~ x1 + x2 + x3 + x5 + x6 + x7 + x8 + x9 + x10 + x13 + x14 + 
##     x15
## 
##        Df Sum of Sq     RSS    AIC
## - x9    1     0.030  99.528 23.527
## - x13   1     0.091  99.590 23.589
## - x6    1     0.106  99.605 23.604
## - x14   1     0.331  99.830 23.830
## - x10   1     0.387  99.885 23.885
## - x7    1     0.925 100.424 24.423
## - x15   1     0.927 100.426 24.425
## - x5    1     1.704 101.202 25.195
## - x8    1     1.772 101.271 25.263
## <none>               99.499 25.498
## - x2    1     3.235 102.734 26.697
## + x4    1     0.019  99.480 27.478
## + x11   1     0.006  99.493 27.492
## + x12   1     0.004  99.494 27.493
## - x3    1    64.460 163.959 73.445
## - x1    1    89.252 188.751 87.526
## 
## Step:  AIC=23.53
## y ~ x1 + x2 + x3 + x5 + x6 + x7 + x8 + x10 + x13 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x13   1     0.098  99.626 21.625
## - x6    1     0.105  99.633 21.633
## - x14   1     0.334  99.862 21.862
## - x10   1     0.390  99.918 21.918
## - x7    1     0.898 100.426 22.425
## - x15   1     0.899 100.427 22.427
## - x5    1     1.739 101.268 23.260
## - x8    1     1.812 101.340 23.331
## <none>               99.528 23.527
## - x2    1     3.286 102.814 24.775
## + x9    1     0.030  99.499 25.498
## + x4    1     0.021  99.508 25.506
## + x11   1     0.013  99.515 25.514
## + x12   1     0.003  99.525 25.524
## - x3    1    65.886 165.414 72.328
## - x1    1    89.761 189.289 85.811
## 
## Step:  AIC=21.63
## y ~ x1 + x2 + x3 + x5 + x6 + x7 + x8 + x10 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x6    1     0.137  99.763 19.763
## - x14   1     0.268  99.894 19.894
## - x10   1     0.379 100.005 20.005
## - x15   1     0.901 100.527 20.526
## - x7    1     0.958 100.583 20.582
## - x8    1     1.767 101.393 21.383
## - x5    1     1.802 101.428 21.418
## <none>               99.626 21.625
## - x2    1     3.396 103.022 22.977
## + x13   1     0.098  99.528 23.527
## + x9    1     0.036  99.590 23.589
## + x11   1     0.032  99.594 23.593
## + x4    1     0.025  99.601 23.600
## + x12   1     0.016  99.610 23.609
## - x3    1    66.674 166.300 70.862
## - x1    1    90.347 189.973 84.171
## 
## Step:  AIC=19.76
## y ~ x1 + x2 + x3 + x5 + x7 + x8 + x10 + x14 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x14   1     0.312 100.075 18.075
## - x10   1     0.506 100.268 18.268
## - x15   1     0.904 100.667 18.665
## - x7    1     1.048 100.811 18.808
## - x5    1     1.742 101.505 19.494
## <none>               99.763 19.763
## - x8    1     2.274 102.037 20.017
## - x2    1     3.321 103.084 21.037
## + x6    1     0.137  99.626 21.625
## + x13   1     0.129  99.633 21.633
## + x11   1     0.041  99.722 21.721
## + x9    1     0.036  99.727 21.727
## + x12   1     0.024  99.739 21.738
## + x4    1     0.010  99.753 21.753
## - x3    1    67.505 167.268 69.443
## - x1    1    90.938 190.701 82.554
## 
## Step:  AIC=18.07
## y ~ x1 + x2 + x3 + x5 + x7 + x8 + x10 + x15
## 
##        Df Sum of Sq     RSS    AIC
## - x10   1     0.441 100.516 16.515
## - x15   1     0.944 101.019 17.014
## - x7    1     0.956 101.031 17.026
## - x5    1     1.706 101.781 17.765
## <none>              100.075 18.075
## - x8    1     2.301 102.376 18.348
## - x2    1     3.278 103.353 19.298
## + x14   1     0.312  99.763 19.763
## + x6    1     0.181  99.894 19.894
## + x13   1     0.050 100.025 20.025
## + x9    1     0.036 100.039 20.039
## + x11   1     0.030 100.045 20.045
## + x12   1     0.023 100.052 20.052
## + x4    1     0.003 100.072 20.072
## - x3    1    67.233 167.308 67.466
## - x1    1    90.885 190.959 80.689
## 
## Step:  AIC=16.51
## y ~ x1 + x2 + x3 + x5 + x7 + x8 + x15
## 
##        Df Sum of Sq    RSS    AIC
## - x7    1     0.871 101.39 15.377
## - x15   1     0.934 101.45 15.439
## - x5    1     1.745 102.26 16.236
## <none>              100.52 16.515
## - x8    1     2.262 102.78 16.741
## - x2    1     3.335 103.85 17.779
## + x10   1     0.441 100.08 18.075
## + x6    1     0.304 100.21 18.212
## + x14   1     0.248 100.27 18.268
## + x13   1     0.057 100.46 18.459
## + x12   1     0.047 100.47 18.468
## + x9    1     0.039 100.48 18.476
## + x11   1     0.015 100.50 18.499
## + x4    1     0.001 100.52 18.514
## - x3    1    69.030 169.55 66.795
## - x1    1    90.692 191.21 78.819
## 
## Step:  AIC=15.38
## y ~ x1 + x2 + x3 + x5 + x8 + x15
## 
##        Df Sum of Sq    RSS    AIC
## - x15   1     0.943 102.33 14.303
## - x5    1     1.694 103.08 15.035
## - x8    1     1.908 103.30 15.242
## <none>              101.39 15.377
## + x7    1     0.871 100.52 16.515
## - x2    1     3.250 104.64 16.532
## + x6    1     0.391 101.00 16.990
## + x10   1     0.356 101.03 17.026
## + x14   1     0.175 101.21 17.204
## + x13   1     0.120 101.27 17.259
## + x11   1     0.027 101.36 17.350
## + x12   1     0.019 101.37 17.359
## + x4    1     0.006 101.38 17.371
## + x9    1     0.006 101.38 17.371
## - x3    1    71.140 172.53 66.538
## - x1    1    91.654 193.04 77.773
## 
## Step:  AIC=14.3
## y ~ x1 + x2 + x3 + x5 + x8
## 
##        Df Sum of Sq    RSS    AIC
## - x5    1     1.645 103.97 13.898
## - x8    1     1.845 104.17 14.089
## <none>              102.33 14.303
## - x2    1     3.186 105.52 15.369
## + x15   1     0.943 101.39 15.377
## + x7    1     0.880 101.45 15.439
## + x6    1     0.399 101.93 15.912
## + x10   1     0.346 101.98 15.964
## + x14   1     0.206 102.12 16.101
## + x13   1     0.117 102.21 16.188
## + x11   1     0.049 102.28 16.255
## + x12   1     0.025 102.30 16.278
## + x9    1     0.019 102.31 16.284
## + x4    1     0.015 102.31 16.288
## - x3    1    70.542 172.87 64.738
## - x1    1    90.899 193.23 75.870
## 
## Step:  AIC=13.9
## y ~ x1 + x2 + x3 + x8
## 
##        Df Sum of Sq    RSS    AIC
## <none>              103.97 13.898
## + x5    1     1.645 102.33 14.303
## - x8    1     2.548 106.52 14.319
## + x15   1     0.893 103.08 15.035
## + x7    1     0.830 103.14 15.096
## + x10   1     0.382 103.59 15.530
## + x6    1     0.296 103.68 15.613
## + x14   1     0.177 103.80 15.727
## + x13   1     0.173 103.80 15.731
## + x11   1     0.143 103.83 15.760
## + x12   1     0.008 103.97 15.890
## + x4    1     0.005 103.97 15.893
## + x9    1     0.002 103.97 15.896
## - x3    1    70.912 174.89 63.896
## - x1    1    89.585 193.56 74.041
## - x2    1    93.028 197.00 75.805
res2$anova
## Stepwise Model Path 
## Analysis of Deviance Table
## 
## Initial Model:
## y ~ x1 + x2 + x3 + x4 + x5 + x6 + x7 + x8 + x9 + x10 + x11 + 
##     x12 + x13 + x14 + x15
## 
## Final Model:
## y ~ x1 + x2 + x3 + x8
## 
## 
##     Step Df    Deviance Resid. Df Resid. Dev      AIC
## 1                              84   99.46513 31.46369
## 2  - x12  1 0.006952389        85   99.47208 29.47068
## 3  - x11  1 0.007725641        86   99.47981 27.47845
## 4   - x4  1 0.018965656        87   99.49877 25.49751
## 5   - x9  1 0.029676558        88   99.52845 23.52733
## 6  - x13  1 0.097504731        89   99.62595 21.62525
## 7   - x6  1 0.136842307        90   99.76280 19.76251
## 8  - x14  1 0.312028722        91  100.07482 18.07480
## 9  - x10  1 0.441356631        92  100.51618 16.51485
## 10  - x7  1 0.870617229        93  101.38680 15.37727
## 11 - x15  1 0.942809323        94  102.32961 14.30289
## 12  - x5  1 1.644849183        95  103.97446 13.89751





#４日目

##分散分析 ## Anova君を使用

#ANOVA君読み込み
source("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/R_code/anovakun_487.txt", encoding = 'UTF-8')
##anovakun
##1 hospital data　一元配置分散分析
hospitalx <- read.csv("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2304/hospitalx.csv")


anovakun(hospitalx,"As",3)
###anova君の変数指定方法
###被験者間要因は「s」の左側にAとして指定、被験者内要因は「s」の右側に指定する。
### 3は各要因の水準の数この場合（A, B, C）

#Rat data 1way ANOVA
anova_tate <- read.csv("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2304/anova_tate.csv")
anovakun(anova_tate,"As",5)
## 
## [ As-Type Design ]
## 
## This output was generated by anovakun 4.8.7 under R version 4.1.3 Patched.
## It was executed on Fri Sep 09 10:34:41 2022.
## 
##  
## << DESCRIPTIVE STATISTICS >>
## 
## ----------------------------
##   A   n      Mean    S.D. 
## ----------------------------
##  a1  10  151.9000  4.9542 
##  a2  10  152.1000  3.8427 
##  a3  10  147.3000  6.0928 
##  a4  10  143.2000  6.7462 
##  a5  10  135.8000  6.4944 
## ----------------------------
## 
## 
## << ANOVA TABLE >>
## 
## ----------------------------------------------------------
##  Source         SS  df        MS  F-ratio  p-value      
## ----------------------------------------------------------
##       A  1855.7200   4  463.9300  14.1337   0.0000 ***  
##   Error  1477.1000  45   32.8244                        
## ----------------------------------------------------------
##   Total  3332.8200  49   68.0167                        
##               +p < .10, *p < .05, **p < .01, ***p < .001
## 
## 
## << POST ANALYSES >>
## 
## < MULTIPLE COMPARISON for "A" >
## 
## == Shaffer's Modified Sequentially Rejective Bonferroni Procedure ==
## == The factor < A > is analysed as independent means. == 
## == Alpha level is 0.05. == 
##  
## ----------------------------
##   A   n      Mean    S.D. 
## ----------------------------
##  a1  10  151.9000  4.9542 
##  a2  10  152.1000  3.8427 
##  a3  10  147.3000  6.0928 
##  a4  10  143.2000  6.7462 
##  a5  10  135.8000  6.4944 
## ----------------------------
## 
## ----------------------------------------------------------
##   Pair     Diff  t-value  df       p   adj.p            
## ----------------------------------------------------------
##  a2-a5  16.3000   6.3617  45  0.0000  0.0000  a2 > a5 * 
##  a1-a5  16.1000   6.2837  45  0.0000  0.0000  a1 > a5 * 
##  a3-a5  11.5000   4.4883  45  0.0000  0.0003  a3 > a5 * 
##  a2-a4   8.9000   3.4736  45  0.0011  0.0069  a2 > a4 * 
##  a1-a4   8.7000   3.3955  45  0.0014  0.0086  a1 > a4 * 
##  a4-a5   7.4000   2.8881  45  0.0059  0.0238  a4 > a5 * 
##  a2-a3   4.8000   1.8734  45  0.0675  0.2701  a2 = a3   
##  a1-a3   4.6000   1.7953  45  0.0793  0.2701  a1 = a3   
##  a3-a4   4.1000   1.6002  45  0.1166  0.2701  a3 = a4   
##  a1-a2  -0.2000   0.0781  45  0.9381  0.9381  a1 = a2   
## ----------------------------------------------------------
## 
## 
## output is over --------------------///
###anova君の変数指定方法
###被験者間要因は「s」の左側にAとして指定、被験者内要因は「s」の右側に指定する。
### 5は各要因の水準の数この場合（A1, A2, A3,A4,A5）



#Dog Repeated
dogx <- read.csv("https://raw.githubusercontent.com/harabou/Biostat_Kyoto_pref/main/data/%2304/dogx.csv")
anovakun(dogx,"sA",5,holm=T, mau=T,eta=T)
## 
## [ sA-Type Design ]
## 
## This output was generated by anovakun 4.8.7 under R version 4.1.3 Patched.
## It was executed on Fri Sep 09 10:34:44 2022.
## 
##  
## << DESCRIPTIVE STATISTICS >>
## 
## -------------------------------
##   A   n       Mean      S.D. 
## -------------------------------
##  a1   6  1253.8333  249.3820 
##  a2   6   969.5000  146.1735 
##  a3   6   934.3333  142.6838 
##  a4   6   927.8333  154.4415 
##  a5   6  1166.8333  199.4597 
## -------------------------------
## 
## 
## << SPHERICITY INDICES >>
## 
## == Mauchly's Sphericity Test and Epsilons ==
## 
## ------------------------------------------------------------------------
##  Effect      W  approx.Chi  df      p         LB     GG     HF     CM 
## ------------------------------------------------------------------------
##       A 0.0588      9.6793   9 0.4317 ns  0.2500 0.5476 0.9913 0.6069 
## ------------------------------------------------------------------------
##                              LB = lower.bound, GG = Greenhouse-Geisser
##                             HF = Huynh-Feldt-Lecoutre, CM = Chi-Muller
## 
## 
## << ANOVA TABLE >>
## 
## --------------------------------------------------------------------
##  Source           SS  df          MS  F-ratio  p-value      eta^2 
## --------------------------------------------------------------------
##       s  687833.4667   5 137566.6933                              
## --------------------------------------------------------------------
##       A  539884.1333   4 134971.0333  18.0043   0.0000 *** 0.3919 
##   s x A  149931.8667  20   7496.5933                              
## --------------------------------------------------------------------
##   Total 1377649.4667  29  47505.1540                              
##                         +p < .10, *p < .05, **p < .01, ***p < .001
## 
## 
## << POST ANALYSES >>
## 
## < MULTIPLE COMPARISON for "A" >
## 
## == Holm's Sequentially Rejective Bonferroni Procedure ==
## == The factor < A > is analysed as dependent means. == 
## == Alpha level is 0.05. == 
##  
## -------------------------------
##   A   n       Mean      S.D. 
## -------------------------------
##  a1   6  1253.8333  249.3820 
##  a2   6   969.5000  146.1735 
##  a3   6   934.3333  142.6838 
##  a4   6   927.8333  154.4415 
##  a5   6  1166.8333  199.4597 
## -------------------------------
## 
## ------------------------------------------------------------
##   Pair       Diff  t-value  df       p   adj.p            
## ------------------------------------------------------------
##  a1-a4   326.0000   5.8561   5  0.0021  0.0206  a1 > a4 * 
##  a1-a2   284.3333   5.7975   5  0.0022  0.0206  a1 > a2 * 
##  a1-a3   319.5000   5.2370   5  0.0034  0.0269  a1 > a3 * 
##  a4-a5  -239.0000   5.1804   5  0.0035  0.0269  a4 < a5 * 
##  a3-a5  -232.5000   5.0938   5  0.0038  0.0269  a3 < a5 * 
##  a2-a5  -197.3333   3.3276   5  0.0208  0.1042  a2 = a5   
##  a2-a3    35.1667   1.4447   5  0.2081  0.8326  a2 = a3   
##  a2-a4    41.6667   1.1770   5  0.2922  0.8765  a2 = a4   
##  a1-a5    87.0000   1.1612   5  0.2980  0.8765  a1 = a5   
##  a3-a4     6.5000   0.2712   5  0.7971  0.8765  a3 = a4   
## ------------------------------------------------------------
## 
## 
## output is over --------------------///
###anova君の変数指定方法
###被験者内要因は「s」の右側に指定する。この場合反復測定のため
### 5は各要因の水準の数この場合（t1, t2, t3,t4,t5）
### mau = T：Mauchlyの球面性検定（デフォルトは、Mendozaの多標本球面性検定） 
### 「long = T」とすると，ロング形式のデータを読み込んで処理
#Blood pressure 
BP <- read.csv("D:/BP.csv")
anovakun(BP,"AsB",holm=T, mau=T,eta=T,long=T)
## 
## [ AsB-Type Design ]
## 
## This output was generated by anovakun 4.8.7 under R version 4.1.3 Patched.
## It was executed on Fri Sep 09 10:34:44 2022.
## 
##  
## << DESCRIPTIVE STATISTICS >>
## 
## ------------------------------------
##  dose  time   n      Mean    S.D. 
## ------------------------------------
##    D1    t0   6  123.0000  8.7407 
##    D1    t1   6  120.1667  6.4627 
##    D1    t3   6  112.6667  7.7374 
##    D2    t0   6  121.6667  9.2880 
##    D2    t1   6  110.6667  7.6855 
##    D2    t3   6  110.0000  4.6904 
## ------------------------------------
## 
## 
## << SPHERICITY INDICES >>
## 
## == Mauchly's Sphericity Test and Epsilons ==
## 
## ------------------------------------------------------------------------
##  Effect      W  approx.Chi  df      p         LB     GG     HF     CM 
## ------------------------------------------------------------------------
##    time 0.5617      5.1907   2 0.0746 +   0.5000 0.6953 0.7722 0.6885 
## ------------------------------------------------------------------------
##                              LB = lower.bound, GG = Greenhouse-Geisser
##                             HF = Huynh-Feldt-Lecoutre, CM = Chi-Muller
## 
## 
## << ANOVA TABLE >>
## 
## ----------------------------------------------------------------------
##          Source        SS  df       MS  F-ratio  p-value      eta^2 
## ----------------------------------------------------------------------
##            dose  182.2500   1 182.2500   1.8055   0.2087 ns  0.0659 
##        s x dose 1009.3889  10 100.9389                              
## ----------------------------------------------------------------------
##            time  742.0556   2 371.0278  10.3430   0.0008 *** 0.2682 
##     dose x time  115.1667   2  57.5833   1.6052   0.2257 ns  0.0416 
## s x dose x time  717.4444  20  35.8722                              
## ----------------------------------------------------------------------
##           Total 2766.3056  35  79.0373                              
##                           +p < .10, *p < .05, **p < .01, ***p < .001
## 
## 
## << POST ANALYSES >>
## 
## < MULTIPLE COMPARISON for "time" >
## 
## == Holm's Sequentially Rejective Bonferroni Procedure ==
## == The factor < time > is analysed as dependent means. == 
## == Alpha level is 0.05. == 
##  
## ------------------------------
##  time   n      Mean    S.D. 
## ------------------------------
##    t0  12  122.3333  8.6269 
##    t1  12  115.4167  8.3933 
##    t3  12  111.3333  6.2571 
## ------------------------------
## 
## ----------------------------------------------------------
##   Pair     Diff  t-value  df       p   adj.p            
## ----------------------------------------------------------
##  t0-t1   6.9167   4.8622  10  0.0007  0.0020  t0 > t1 * 
##  t0-t3  11.0000   3.8677  10  0.0031  0.0062  t0 > t3 * 
##  t1-t3   4.0833   1.4599  10  0.1750  0.1750  t1 = t3   
## ----------------------------------------------------------
## 
## 
## output is over --------------------///
###anova君の変数指定方法
###被験者間要因は「s」の左側に指定する。被験者内要因は「s」の右側に指定する。
###データはロング（横）型
#Two-wayANOVA
twoway <- read.csv("D:/twoway.csv")
anovakun(twoway,"ABs",3,2,holm=T)
## 
## [ ABs-Type Design ]
## 
## This output was generated by anovakun 4.8.7 under R version 4.1.3 Patched.
## It was executed on Fri Sep 09 10:34:44 2022.
## 
##  
## << DESCRIPTIVE STATISTICS >>
## 
## -------------------------------
##   A   B   n     Mean    S.D. 
## -------------------------------
##  a1  b1   5   7.4840  0.5654 
##  a1  b2  13   6.7846  1.8243 
##  a2  b1   7  11.1529  2.8531 
##  a2  b2   5   6.5060  2.3357 
##  a3  b1   6  12.7183  1.1780 
##  a3  b2   5   8.1580  3.7092 
## -------------------------------
## 
## 
## << ANOVA TABLE >>
## 
## == This data is UNBALANCED!! ==
## == Type III SS is applied. ==
## 
## --------------------------------------------------------
##  Source        SS  df       MS  F-ratio  p-value      
## --------------------------------------------------------
##       A   68.4391   2  34.2196   6.8892   0.0030 **   
##       B   99.4886   1  99.4886  20.0295   0.0001 ***  
##   A x B   33.6024   2  16.8012   3.3825   0.0454 *    
##   Error  173.8487  35   4.9671                        
## --------------------------------------------------------
##   Total  393.1910  40   9.8298                        
##             +p < .10, *p < .05, **p < .01, ***p < .001
## 
## 
## << POST ANALYSES >>
## 
## < MULTIPLE COMPARISON for "A" >
## 
## == Holm's Sequentially Rejective Bonferroni Procedure ==
## == The factor < A > is analysed as independent means. == 
## == Alpha level is 0.05. == 
##  
## ---------------------------
##   A   n     Mean    S.D. 
## ---------------------------
##  a1  18   7.1343  1.5901 
##  a2  12   8.8294  3.4856 
##  a3  11  10.4382  3.4451 
## ---------------------------
## 
## ----------------------------------------------------------
##   Pair     Diff  t-value  df       p   adj.p            
## ----------------------------------------------------------
##  a1-a3  -3.3039   3.6957  35  0.0007  0.0022  a1 < a3 * 
##  a1-a2  -1.6951   1.9322  35  0.0615  0.1229  a1 = a2   
##  a2-a3  -1.6087   1.7139  35  0.0954  0.1229  a2 = a3   
## ----------------------------------------------------------
## 
## 
## < SIMPLE EFFECTS for "A x B" INTERACTION >
## 
## --------------------------------------------------------
##   Source        SS  df       MS  F-ratio  p-value     
## --------------------------------------------------------
##  A at b1   77.5553   2  38.7776   7.8069   0.0016 **  
##  A at b2    8.5163   2   4.2582   0.8573   0.4330 ns  
##  B at a1    1.7663   1   1.7663   0.3556   0.5548 ns  
##  B at a2   62.9804   1  62.9804  12.6795   0.0011 **  
##  B at a3   56.7181   1  56.7181  11.4187   0.0018 **  
##    Error  173.8487  35   4.9671                       
## --------------------------------------------------------
##             +p < .10, *p < .05, **p < .01, ***p < .001
## 
## 
## < MULTIPLE COMPARISON for "A at b1" >
## 
## == Holm's Sequentially Rejective Bonferroni Procedure ==
## == The factor < A at b1 > is analysed as independent means. == 
## == Alpha level is 0.05. == 
##  
## ----------------------------------------------------------
##   Pair     Diff  t-value  df       p   adj.p            
## ----------------------------------------------------------
##  a1-a3  -5.2343   3.8786  35  0.0004  0.0013  a1 < a3 * 
##  a1-a2  -3.6689   2.8114  35  0.0080  0.0161  a1 < a2 * 
##  a2-a3  -1.5655   1.2625  35  0.2151  0.2151  a2 = a3   
## ----------------------------------------------------------
## 
## output is over --------------------///
###被験者間要因は「s」の左側に指定する。
###この場合は、二要因（性別、薬剤）
